/*
 * @lc app=leetcode.cn id=7 lang=c
 *
 * [7] 整数反转
 *
 * https://leetcode-cn.com/problems/reverse-integer/description/
 *
 * algorithms
 * Medium (35.17%)
 * Likes:    3431
 * Dislikes: 0
 * Total Accepted:    968.4K
 * Total Submissions: 2.8M
 * Testcase Example:  '123'
 *
 * 给你一个 32 位的有符号整数 x ，返回将 x 中的数字部分反转后的结果。
 *
 * 如果反转后整数超过 32 位的有符号整数的范围 [−2^31,  2^31 − 1] ，就返回 0。
 * 假设环境不允许存储 64 位整数（有符号或无符号）。
 *
 *
 *
 * 示例 1：
 *
 *
 * 输入：x = 123
 * 输出：321
 *
 *
 * 示例 2：
 *
 *
 * 输入：x = -123
 * 输出：-321
 *
 *
 * 示例 3：
 *
 *
 * 输入：x = 120
 * 输出：21
 *
 *
 * 示例 4：
 *
 *
 * 输入：x = 0
 * 输出：0
 *
 *
 *
 *
 * 提示：
 *
 *
 * -2^31
 *
 *
 */

// @lc code=start

/*测试用例
123
-123
120
0
2147483647
1111111111
1111111113
-1111111113
*/

int reverse(int x)
{

    // 这题的要点是溢出判断，反转属于基本操作

    // 2^31 -1 = 2147483647
    // -2^31 = -2147483648

    /**
     * 数学方法
     * 翻转思路：不断对取模、取商
     *
     * 临界条件：
     *      （前提是数字有10位）
     *       正数：
     *            前 9 位大于 214748364，必然溢出
     *            前 9 位等于 214748364，第10位大于7，必然溢出
     *       负数：
     *            前 9 位小于 -214748364，必然溢出
     *            前 9 位等于 -214748364，第10位小于-8，必然溢出
     */
    int num = x;
    int result = 0;
    while (num != 0)
    {
        // 先看下是不是到临界条件了
        if (result > 214748364 || result < -214748364 || result == 214748364 && (num % 10) > 7 || result == -214748364 && (num % 10) < -8)
            return 0;

        result = result * 10 + num % 10;
        num = num / 10;
    }
    return result;
}
// @lc code=end
